In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('titanic.csv', index_col='PassengerId')

In [ ]:
df[:10]

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
6                   0       3  ...   NaN        Q
7                   0       1  ...   E46        S
8                   0       3  ...   NaN        S
9                   1       3  ...   NaN        S
10                  1       2  ...   NaN        C

[10 rows x 11 columns]

In [ ]:
def rounder(a) -> str:
    return f'{a: 0.2f}'


def writer(string: str, filename: str) -> None:
    with open(filename, 'w') as f:
        f.write(string)
    f.close()

In [ ]:
string = str()
for i in df['Sex'].value_counts():
    string += rounder(i) + ' '
writer(string, 'sub_1.txt')

In [ ]:
survived = rounder((df['Survived'].value_counts()[1] / len(df)) * 100)
writer(survived, 'sub_2.txt')

In [ ]:
first_class = rounder(df['Pclass'].value_counts()[1] / len(df) * 100)
writer(first_class, 'sub_3.txt')

In [ ]:
writer(rounder(df['Age'].mean()) + ' ' + rounder(df['Age'].median()), 'sub_4.txt')

In [ ]:
writer(rounder(df[['SibSp', 'Parch']].corr(method='pearson').iloc[1]['SibSp']), 'sub_5.txt')

In [ ]:
df[df['Sex'] == 'female']['Name'].str.split('.').str[1].str.split(' ').str[1].value_counts(),

(William      13
 Mary          9
 Anna          9
 Thomas        6
 Elizabeth     6
              ..
 Daisy         1
 Oscar         1
 Doolina       1
 Nora          1
 (Mary)        1
 Name: Name, Length: 203, dtype: int64,)

In [ ]:
writer('Mary', 'sub_6.txt')